Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྒོམ་པ་དེ་དག་ལ་བདུད་སྡིག་ཏོ་ཅན་གྱིས་བར་ཆད་བྱ་བར་མི་ནུས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་དགོངས་ཤིང་ཡོངས་སུ་འཛིན་པ་མཛད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་། སྟོན་པ་དང་ཁ་ཏོན་དུ་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: Those lord buddhas indeed have their enlightened intention directed toward those bodhisattva great beings, and accept them, so that the evil forces of Māra cannot cause obstacles for those bodhisattva great beings who have been accepted by the lord buddhas and who commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, or focus their attention correctly on it.

source: སྒོམ་པ་དེ་དག་ལ་བདུད་སྡིག་ཏོ་ཅན་གྱིས་བར་ཆད་བྱ་བར་མི་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་བདུད་སྡིག་ཏོ་ཅན་གྱིས་བར་ཆད་བྱ་བར་མི་ནུས་སོ།
en: If you ask why, Śāradvatīputra, it is because the evil forces of Māra are incapable of causing obstacles for bodhisattva great beings who have been accepted by the buddhas and who have pursued virtuous attributes.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་གང་དེ་ལྟར་ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད་གྲངས་མེད་པ་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་ལ་དགོངས་པ་མཛད་པ་དང་། ཀློག་ཅིང་སྟོན་པ་དང་། ཁ་ཏོན་དུ་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པ་ལ་དགོངས་པ་མཛད་པ་ནི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, it is in accord with reality that the immeasurable and countless tathāgatas, arhats, completely awakened buddhas who are alive at present, residing in the immeasurable, countless world systems of all the ten directions, teaching the Dharma, direct their enlightened intention toward bodhisattva great beings who commit this profound perfection of wisdom to writing, and direct their enlightened intention toward those who recite, teach, disseminate, cultivate, and focus their attention correctly on it.

source: ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། སྟོན་ཅིང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པ་དེས་ཀྱང་བདག་ནི་སངས་རྒྱས་ཀྱི་མཐུས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲིའོ། །ཀློག་གོ། །སྟོན་ཏོ། ཁ་ཏོན་དུ་བྱེད་དོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་དོ། །སྒོམ་མོ་ཞེས་བྱ་བར་ཁོང་དུ་ཆུད་པར་བྱའོ། །གསོལ་པ།
en: Śāradvatīputra, noble sons and noble daughters who commit this profound perfection of wisdom to writing, and recite, teach, cultivate, and focus their attention correctly on it should understand that it is through the power of the buddhas that they themselves are committing this profound perfection of wisdom to writing, and reciting, teaching, cultivating, and focusing their attention correctly on it.” “

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་སུ་ཡང་རུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་ཀློག་པ་དང་སྟོན་པ་དང་ཁ་ཏོན་དུ་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དང་། སྒོམ་མོ་འཚལ་ཀུན་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུ་ལགས་སམ། ཀུན་ཀྱང་སངས་རྒྱས་ཀྱི་གཟུངས་ལགས་སམ།
en: Blessed Lord, should all noble sons and noble daughters whosoever know that they commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, and focus their attention correctly on it, through the power of the buddhas, and are all of them sustained by the buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, it is so! It is so,” replied the Blessed One. “

source: ཇི་སྐད་དུ་སྨྲས་པ་བཞིན་ཏེ།
en: It is as you have said.

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་སུའང་རུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། སྟོན་ཅིང་ཁ་ཏོན་དུ་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་སྒོམ་པ་དེ་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུ་ཡིན་པར་རིག་པར་བྱའོ།
en: All noble sons or noble daughters whosoever should know that they commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, and focus their attention correctly on it, {Ki.IV: 27} through the power of the buddhas.

source: །དེ་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་གཟུངས་ཡིན་པར་རིག་པར་བྱའོ། །གསོལ་པ།
en: All of them should know that they are sustained by the buddhas.” “

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། སྟོན་ཅིང་ཁ་ཏོན་དུ་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ཅིང་སྒོམ་པ་དེ་དག་ནི་ཤར་ཕྱོགས་ནས་ཕྱོགས་བཅུ་ཀུན་གྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་དང་གྲངས་མ་མཆིས་པ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་དང་གྲངས་མ་མཆིས་པ་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་ཆོས་སྟོན་པ་དེ་དག་གིས་མཁྱེན་ཏེ།
en: Blessed Lord, the immeasurable and countless lord buddhas who are alive at present, teaching the Dharma in immeasurable, countless world systems, extending from the eastern direction throughout the ten directions, know those noble sons or noble daughters who commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, and focus their attention correctly on it.

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། སྟོན་ཅིང་ཁ་ཏོན་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ཅིང་སྒོམ་པ་དེ་དག་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་སོ། །ཐུགས་སུ་ཆུད་དོ།
en: Those lord buddhas see with the buddha eye and comprehend those who commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, and focus their attention correctly on it.” “

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་ཀློག་པ་དང་། སྟོན་ཅིང་ཁ་ཏོན་དུ་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་སྒོམ་པ་དེ་དག་ནི་ཤར་ཕྱོགས་ནས་ཕྱོགས་བཅུ་ཀུན་གྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་དང་གྲངས་མེད་པ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་གིས་མཁྱེན་ཏེ།
en: The immeasurable and countless lord buddhas who are alive at present, teaching the Dharma in immeasurable, countless world systems, extending from the eastern direction throughout the ten directions, know those noble sons or noble daughters who commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, and focus their attention correctly on it.

source: སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་སོ། །ཐུགས་སུ་ཆུད་དོ།། །།
en: They see them with the buddha eye and comprehend them. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་གསུམ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པ་དང་།
en: In this regard, Śāradvatīputra, those noble sons or noble daughters who follow the vehicle of the bodhisattvas, and who take up, uphold, recite, master, and cultivate this profound perfection of wisdom, focusing their attention correctly on it, and who earnestly apply it in an authentic manner, should also know that they themselves are drawing near to unsurpassed, complete enlightenment.

source: དེ་བཞིན་དུ་ནན་ཏན་བྱེད་པ་དེ་དག་གིས་ཀྱང་འདི་ལྟར་བདག་ཅག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་ཏོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པ་མང་བར་འགྱུར་ཏེ།
en: Śāradvatīputra, those noble sons or noble daughters who follow the vehicle of the bodhisattvas, and who have committed this profound perfection of wisdom to writing and keep it in the form of a book, also develop much devotion to this profound perfection of wisdom.

source: དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་མང་པོས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད་བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་དོ།
en: They serve, respect, honor, and worship this profound perfection of wisdom with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons. {

source: །དེ་ལྟར་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བྲིས་ཤིང་འཆང་བ་དེ་དག་ཀྱང་དོན་ཆེ་བ་དང་ལེགས་པ་ཆེ་བ་དང་འབྲས་བུ་ཆེ་བ་དང་།
en: Ki.IV: 28} “So it is that those noble sons or noble daughters who commit this profound perfection of wisdom to writing and keep it will incur great benefit, great excellence, great outcome, and great maturation.

source: རྣམ་པར་སྨིན་པ་ཆེ་བར་འགྱུར་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ཡོངས་སུ་ནོན་གྱི་བར་དུ་དགེ་བའི་རྩ་བ་དེས་ནམ་ཡང་ངན་སོང་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: Śāradvatīputra, until they occupy the level at which progress has become irreversible, those noble sons or noble daughters on account of these roots of virtuous action will never be reborn in lower realms of existence.

source: །ནམ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the lord buddhas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ།
en: Śāradvatīputra, until they attain consummate buddhahood in unsurpassed, complete enlightenment, those noble sons or noble daughters on account of these roots of virtuous action will never be separated from the six perfections.

source: །ནང་སྟོང་པ་ཉིད་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They will never be separated from [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་།
en: They will never be separated from the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—or the extrasensory powers.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the meditative stabilities or the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་ནས། ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་ན་སྤྱོད་པར་འགྱུར་ཏེ།
en: Śāradvatīputra, after the Tathāgata has passed into nirvāṇa, this perfection of wisdom will circulate in the south.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་དགེ་སློང་དང་དགེ་སློང་མ་དང་དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་དག་མོས་པ་དམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བར་འགྱུར་འཛིན་པར་འགྱུར་འཆང་བར་འགྱུར་ཀློག་པར་འགྱུར་ཀུན་ཆུབ་པར་བྱེད་པར་འགྱུར་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པར་འགྱུར་ཏེ་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་མང་པོས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད།
en: There, the monks, nuns, laymen, and laywomen who follow the vehicle of the bodhisattvas will commit this profound perfection of wisdom to writing with firm devotion. They will take up, uphold, recite, and master it, focusing their attention correctly on it, and they will serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons.

source: མཆོད་པར་བྱེད་པར་འགྱུར་རོ། །དེ་དག་དགེ་བའི་རྩ་བ་དེས་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མི་འདོད་སྟེ།
en: On account of those roots of virtuous action, they will never lapse into lower realms of existence.

source: དེ་དག་གིས་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་ཞིང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་མངོན་པར་འཕགས་པར་གྱུར་ནས།
en: They will experience the excellence of gods and humans, and they will be ennobled through the six perfections.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་ཅིང་། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Having been ennobled through these six perfections, they will serve, respect, honor, and worship the lord buddhas, and gradually pass into nirvāṇa through the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of the unsurpassed, completely awakened buddhas, or through all three vehicles. “

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་ནས། ཡུལ་བརྟ་ནི་ན་སྤྱོད་པར་འགྱུར་ཏེ།
en: Śāradvatīputra, this profound perfection of wisdom will then circulate from the south to the east.

source: དེ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དག་མོས་པ་དམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བར་འགྱུར། འཛིན་པར་འགྱུར།
en: There, too, the monks, nuns, laymen, and laywomen who follow the vehicle of the bodhisattvas will commit this profound perfection of wisdom to writing with firm devotion.

source: འཆང་བར་འགྱུར། ཀློག་པར་འགྱུར། ཀུན་ཆུབ་པར་བྱེད་པར་འགྱུར། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པར་འགྱུར།
en: They will take up, uphold, {Ki.

source: མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་མང་པོས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད་བསྟི་སྟང་དུ་བྱེད་མཆོད་པར་བྱེད་པར་འགྱུར་ཏེ།
en: IV: 29} recite, and master it, focusing their attention correctly on it, and they will serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons.

source: དེ་དག་དགེ་བའི་རྩ་བ་དེས་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མི་འདོང་སྟེ།
en: On account of those roots of virtuous action, they will never lapse into lower realms of existence.

source: དེ་དག་གིས་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་ཞིང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: They will experience the excellence of gods and humans, and they will be ennobled through the six perfections.

source: །དེ་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་མངོན་པར་འཕགས་པར་གྱུར་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་ཅིང་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Having been ennobled through these six perfections, they will serve, respect, honor, and worship the lord buddhas, and gradually pass into nirvāṇa through the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of the unsurpassed, completely awakened buddhas, or through all three vehicles. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཡུལ་བརྟ་ནི་ནས་བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ན་སྤྱོད་པར་འགྱུར་ཏེ།
en: Śāradvatīputra, this profound perfection of wisdom will then circulate from the east to the north.

source: དེ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་དགེ་སློང་དང་དགེ་སློང་མ་དང་དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་དག་མོས་པ་དམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བར་འགྱུར། འཛིན་པར་འགྱུར། འཆང་བར་འགྱུར། ཀློག་པར་འགྱུར། ཀུན་ཆུབ་པར་བྱེད་པར་འགྱུར།
en: There, too, the monks, nuns, laymen, and laywomen who follow the vehicle of the bodhisattvas will commit this profound perfection of wisdom to writing with firm devotion.

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པར་འགྱུར། མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་མང་པོ་དག་གིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་པར་འགྱུར་ཏེ།
en: They will take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom, and they will serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons.

source: དེ་དག་དགེ་བའི་རྩ་བ་དེས་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མི་འདོད་སྟེ།
en: On account of those roots of virtuous action, they will never lapse into lower realms of existence.

source: དེ་དག་གིས་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་ཞིང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་མངོན་པར་འཕགས་པར་གྱུར་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་།
en: They will experience the excellence of gods and humans, and they will be ennobled through the six perfections.

source: བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་ཅིང་། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Having been ennobled through these six perfections, they will serve, respect, honor, and worship the lord buddhas, and gradually pass into nirvāṇa through the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of the unsurpassed, completely awakened buddhas, or through all three vehicles. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དང་། བྱང་ཕྱོགས་ཀྱི་རྒྱུད་ན། ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ། ལྔ་བརྒྱ་ཐ་མ་ལ། སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པར་འགྱུར་རོ།
en: Śāradvatīputra, so it is that, afterward, during the future, this perfection of wisdom will perform the activities of the buddhas in the south, the east, and the north for the final five-hundred[-year period of the Buddhist teaching].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དགོངས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་དགོངས་པའོ།
en: If you ask why, Śāradvatīputra, it is because the enlightened intention of the tathāgatas is the perfection of wisdom, and the perfection of wisdom is the enlightened intention of the tathāgatas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་དང་འདུལ་བ་དར་ལ་བབ་པའི་ཚེ། དམ་པའི་ཆོས་ནུབ་པར་མི་འགྱུར་ཏེ།
en: Śāradvatīputra, when noble sons or noble daughters flourish in the Dharma and in Vinaya, the Dharma will not decline.

source: ཆོས་དེ་ཡང་གང་ཞེན་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའོ།
en: If you ask what is that Dharma, it is this perfection of wisdom.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་དུ་བྱེད་པ་དེ་དག་ལ་ནི་ངས་དགོངས་སོ།
en: Śāradvatīputra, I turn my enlightened intention toward those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom, and who earnestly apply it in an authentic manner.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་ཞིང་བྲིས་ནས་ཀྱང་། མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་མང་པོས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་པ་དེ་དག་ཀྱང་ངས་དགོངས་ཏེ།
en: Śāradvatīputra, I turn my enlightened intention toward those noble sons or noble daughters who commit this profound perfection of wisdom to writing, and who, having committed it to writing, also serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many ribbons.

source: ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་དེས་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མི་འདོད་སྟེ།
en: Śāradvatīputra, on account of these roots of virtuous action, those noble sons or noble daughters will never lapse into lower realms of existence.

source: དེ་དག་ལྷ་དང་མིའི་བདེ་བ་ཕུན་སུམ་ཚོགས་པ་མྱོང་ཞིང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་མངོན་པར་འཕགས་པར་གྱུར་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་།
en: They will experience the excellence of gods and humans, and they will be ennobled through the six perfections.

source: བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་ཅིང་། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་མྱ་ངན་ལས་འདའ་པར་འགྱུར་རོ།
en: Having been ennobled through these six perfections, they will serve, respect, honor, and worship the lord buddhas, and gradually pass into nirvāṇa through the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of the unsurpassed, completely awakened buddhas, or through all three vehicles. {

source: ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་སོ།
en: IV: 30} “Śāradvatīputra, the tathāgatas see those noble sons or noble daughters with the eye of the buddhas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་བརྗོད་དོ།
en: Śāradvatīputra, the tathāgatas mention those noble sons or noble daughters.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་བསྟོད་དོ། །བསྔགས་སོ།
en: Śāradvatīputra, the tathāgatas praise and extol those noble sons or noble daughters.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་སོ།
en: Śāradvatīputra, the tathāgatas, arhats, completely awakened buddhas of the ten directions who are alive at present, teaching the Dharma, also see those noble sons or noble daughters with the eye of the buddhas.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་བརྗོད་དོ། །བསྟོད་དོ།
en: Those tathāgatas, arhats, completely awakened buddhas mention, praise, and extol those noble sons or noble daughters. Śāradvatīputra, the tathāgatas praise and extol those noble sons or noble daughters.” “

source: །བསྔགས་སོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་སླད་མའི་དུས་སླད་མའི་ཚེ་ན། བྱང་ཕྱོགས་སུ་རྒྱས་པར་འགྱུར་རོ།
en: Blessed Lord, afterward, in the future, will this profound perfection of wisdom flourish in the north?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, it is so! It is so,” replied the Blessed One. “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན། བྱང་ཕྱོགས་སུ་རྒྱས་པར་འགྱུར་ཏེ།
en: Śāradvatīputra, afterward, in the future, this profound perfection of wisdom will flourish in the north.

source: དེ་ལ་ཤ་ར་དྭ་ཏིའི་བུ་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་པར་འགྱུར་ཏེ། ཐོས་ནས་ཀྱང་མོས་པར་འགྱུར་རོ། །མོས་པར་བྱས་ནས་ཀྱང་འདྲི་བ་དང་།
en: In this regard, Śāradvatīputra, afterward, in future times, those noble sons or noble daughters will hear this profound perfection of wisdom flourishing in the north, and having heard it they will also be devoted to it.
